과제 : 총 3개의 파일 올릴 것! 0506, 0513, 0520

loc와 iloc은 각각 어떤 때 사용하는 게 좋은가?
- loc : 특정 이름을 지칭하면서 하기 때문에 이름을 알고 있을 때 하는 게 좋다. iloc : 인덱스값을 하기 때문에 앞뒤로 몇개씩 찾아서 하는 거에 유리 .단계적으로 접근 하는 게 좋다.

boolean indexing은 무엇을 하기 위한 것인가? 또한 이를 위해 loc와 iloc 중 뭐가 적합한가?
- query는 열이 다 나오는 것. boolean indexing은 2가지로 쓴다. 첫 번째 방법은 query 메소드 통해서 그 안에 조건을 줘서 하는 경우, 두 번째 경우는 []안에다가 조건을 넣어서 하는 경우. []안에 조건을 쓰게 되면 그 안에 column명을 써야 되는데 쓸 때 마다 데이터프레임 앞에 ,을 찍어야 한다. 그러면 코드가 길어지게 된다. 그래서 query로 쓰게 되면 코드가 짧아지게 되어서 더 편하다. loc은 가능하다. [] , 왼쪽 행. 오른쪽은 열 , 왼쪽에 조건을 달고 , 오른쪽은 추출하고 싶은 column명만 쓰면 된다. loc은 , 왼쪽에 조건문이 나올 수 있다. iloc은 안 된다. loc iloc은 행과 열을 같이 뽑는 것.

컬럼별로 결측값이 몇 개나 있는지 알려면 어떤 명령어를 사용하는가?
- data.isnull.sum()을 사용하면 된다. data.isnull까지 입력하게 되면 결측값이 있으면 1 없으면 0이 된다. 각 행 별로 1,0으로 나와서 여기서 sum을 하게 되면 결측값이 다 1로 나와서 다 합하면 결측값 갯수를 알 수 있게 된다.

isnull(), isna(), notna()의 차이는?
- pandas에서는 isnull와 isna이 같다. notna는 isnull과 반대된다.

본인이 생각하는 Series의 중요 메소드 5가지를 제시하고 설명하라.
- value_counts : 시리즈 안에 있는 값들의 갯수를 찾는 것 nunique : unique 한 값 갯수 찾기, isnull : 결측값을 찾을 때 쓰는 것 Series는 index와 value로 구성되어 있다. 
- Series에는 값이 쭉 있으면 Series값을 정렬하는 코드. 오름차순, 내림차순 : sort_value, 

df에서 데이터를 요약할 때 axis 파라미터가 의미하는 것은?
- 행 간에 계산해라. 결과는 열만 나온다. 

df에서 copy() 메소드가 필요한 이유가 무엇인가?
- 어떠 한 변수에 df를 저장해서 사용하는데 변수를 가공하면 df에도 영향을 미쳐서 copy해서 사용하는 게 df에 영향을 미치지 않는다.

query() 메소드에서 특정 변수를 조건에 지정하려면 어떻게 해야하나?
'''
x = 3
df.query('A > x')
query에서는 현재 x 부분은 column명으로 받아들인다. 그래서 변수로 조건을 지정하려면 @x로 해야된다. @를 추가해야 한다.(중요하다**)
'''

In [2]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

<font color = "#CC3D3D"><p>
# Topics
* [Group Aggregation](#Group-Aggregation)
* [Pivot Tables](#Pivot-Tables)
* [Merging DataFrames](#Merging-DataFrames)
* [Appending DataFrames](#Appending-DataFrames)

## Group Aggregation
<br><img align="left" src="http://drive.google.com/uc?export=view&id=17lLj-fLLYk6Dxcz7yBIX7bMEl4PAESBB" width=800 height=600>

In [3]:
df = DataFrame({'key'  : ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'],
                'data' : [0, 5, 10, 5, 10, 15, 10, 15, 20]})
df

  key  data
0   A     0
1   B     5
2   C    10
3   A     5
4   B    10
5   C    15
6   A    10
7   B    15
8   C    20

<font color = 'blue'>Typical usage

In [54]:
df.groupby('key')['data'].sum()

key
A    15
B    30
C    45
Name: data, dtype: int64

In [59]:
df.groupby('key')['data'].std()

key
A    5.0
B    5.0
C    5.0
Name: data, dtype: float64

In [55]:
df.groupby('key')['data'].size()  # size()는 결측값 포함해서 빈도 측정, count()는 결측값 제외

key
A    3
B    3
C    3
Name: data, dtype: int64

In [57]:
# When we reset the index, the old index is added as a column, and a new sequential index is used
df.groupby('key')['data'].sum().reset_index() # .reset_index로 하면 dataframe으로 바뀐다.

  key  data
0   A    15
1   B    30
2   C    45

In [ ]:
df.groupby('key', as_index=False)['data'].sum()

<font color = 'blue'>Iterating through groups

In [77]:
grouped = df.groupby('key')['data']
for name, group in grouped:
    print(name)
    print(group)

A
0     0
3     5
6    10
Name: data, dtype: int64
B
1     5
4    10
7    15
Name: data, dtype: int64
C
2    10
5    15
8    20
Name: data, dtype: int64

In [78]:
[v for v in grouped.get_group('A')]

[0, 5, 10]

<font color = 'blue'>Filtration

In [79]:
print(df)
df.groupby('key')['data'].sum()

  key  data average
0   A     0   below
1   B     5   below
2   C    10   below
3   A     5   below
4   B    10   below
5   C    15   above
6   A    10   below
7   B    15   above
8   C    20   above

key
A    15
B    30
C    45
Name: data, dtype: int64

In [80]:
df.groupby('key')['data'].filter(lambda x: x.sum() > 30)

2    10
5    15
8    20
Name: data, dtype: int64

<font color = 'blue'>Using agg method

In [60]:
df.groupby('key')['data'].agg('max') # agg 함수는 내가 정의한 함수를 불러올 때 쓰는 함수. 함수를 2개 이상 동시에 호출하고 싶을 때

key
A    10
B    15
C    20
Name: data, dtype: int64

In [61]:
df.groupby('key')['data'].agg(lambda x: x.max() - x.min())

key
A    10
B    10
C    10
Name: data, dtype: int64

<font color = 'blue'>Applying multiple functions at once

In [64]:
df.groupby('key')['data'].agg([('평균','mean'), 'std']).reset_index()   # 튜플로 만들어서 평균값을 집어넣고 싶을 때
df.groupby('key')['data'].agg(['mean', 'std']).reset_index()

  key  mean  std
0   A     5  5.0
1   B    10  5.0
2   C    15  5.0

<font color = 'blue'>Named aggregation

In [65]:
df.groupby('key')['data'].agg([('평균','mean'), ('표준편차','std')]).reset_index()

  key  평균  표준편차
0   A   5   5.0
1   B  10   5.0
2   C  15   5.0

<font color = 'blue'>By default, all of the numeric columns are aggregated.

In [66]:
df['average'] = df.data.apply(lambda x, y: 'above' if x > y else 'below', args=(df.data.mean(),))
df

  key  data average
0   A     0   below
1   B     5   below
2   C    10   below
3   A     5   below
4   B    10   below
5   C    15   above
6   A    10   below
7   B    15   above
8   C    20   above

In [67]:
df.groupby(['key']).mean()

     data
key
A       5
B      10
C      15

<font color = 'blue'>Applying different functions to DataFrame columns

In [68]:
df.groupby('key').agg({'data' : [('평균','mean'), ('합계', np.sum)], 'average' : [('범주',Series.nunique)]})

    data     average
      평균  합계      범주
key
A      5  15       1
B     10  30       2
C     15  45       2

In [76]:
tr.groupby('ID').agg({
    '상품중분류명': [('구매다양성', Series.nunique)], 
    '구매일자': [('최초구매일',np.min)],
    '구매금액': [('총구매액',np.sum)],
}).reset_index()
# 파이썬은 마지막에 콤마를 집어넣어도 가능하다

'''tr.groupby('상품중분류명').agg({
    
})
'''
# 가장 중요한 코드, 무조건 알아야 나중에 도움 무조건 된다!

             ID 상품중분류명      구매일자      구매금액
                 구매다양성     최초구매일      총구매액
0        741463      3  20140115    560000
1        909249     12  20140118    640000
2       1065068      7  20140706   1103000
3       1310410      2  20140119    249000
4       1387032      3  20140118    113000
...         ...    ...       ...       ...
3537  998623524     11  20140221   2088000
3538  999024423      3  20140517     25000
3539  999184958     11  20140115   3147000
3540  999375162     12  20140103  10762000
3541  999494396      2  20140626    348000

[3542 rows x 4 columns]

## Pivot Tables
<br><img align="left" src="http://drive.google.com/uc?export=view&id=1HEBp4qq4GaksdQBb2fx2tRsq-gVR-j6d" width=800 height=600>

In [21]:
tr = pd.DataFrame({
        'id': [1,1,1,1,2,2,2],
        'site': ['a','b','c','a','a','b','b'],
        'pageview': np.arange(1,8),
        'dwelltime': np.arange(7.0, 0, -1),
    }, columns=['id','site','pageview','dwelltime'])

tr

   id site  pageview  dwelltime
0   1    a         1        7.0
1   1    b         2        6.0
2   1    c         3        5.0
3   1    a         4        4.0
4   2    a         5        3.0
5   2    b         6        2.0
6   2    b         7        1.0

In [22]:
pd.pivot_table(tr, values='pageview', index='id', columns='site', 
               aggfunc=sum)

site    a     b    c
id
1     5.0   2.0  3.0
2     5.0  13.0  NaN

In [23]:
pd.pivot_table(tr, values='pageview', index='id', columns='site', 
               aggfunc=sum, fill_value=0)

site  a   b  c
id
1     5   2  3
2     5  13  0

In [24]:
pd.pivot_table(tr, values='pageview', index='id', columns='site', 
               aggfunc=sum, fill_value=0).reset_index()

site  id  a   b  c
0      1  5   2  3
1      2  5  13  0

In [25]:
pv = pd.pivot_table(tr, values='pageview', index='id', columns='site',
                    aggfunc=sum, fill_value=0).reset_index()
pv.columns.name = None; pv

   id  a   b  c
0   1  5   2  3
1   2  5  13  0

In [26]:
pd.pivot_table(tr, values='pageview', index='id', 
               aggfunc=np.mean, fill_value=0).reset_index()

   id  pageview
0   1       2.5
1   2       6.0

In [27]:
pd.pivot_table(tr, values='pageview', columns='site', 
               aggfunc=np.size, fill_value=0)

site      a  b  c
pageview  3  3  1

In [28]:
tr

   id site  pageview  dwelltime
0   1    a         1        7.0
1   1    b         2        6.0
2   1    c         3        5.0
3   1    a         4        4.0
4   2    a         5        3.0
5   2    b         6        2.0
6   2    b         7        1.0

## Merging DataFrames

In [29]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                 'data1': range(7)})
df2 = DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})

In [30]:
display(df1)
display(df2)

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

  key  data2
0   a      0
1   b      1
2   d      2

In [31]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

<font color = 'blue'>If not specified, merge uses the overlapping column names as the keys. It’s a good practice to specify explicitly, though:

In [32]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

<font color = 'blue'>If the column names are different in each object, you can specify them separately:

In [33]:
df3 = DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                 'data1': range(7)})
df4 = DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

In [34]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

<font color='darkgreen'><p>
##### Merge Types
<br><img align="left" src="http://drive.google.com/uc?export=view&id=1yEU_xZ9qZrZi8IIWTMhhMIKI95XxisX0" width=900 height=800>

<font color = 'blue'>By default merge does an 'inner' join; the keys in the result are the intersection. The outer join takes the union of the keys:

In [35]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

<font color = 'blue'>Pandas also provides the *merge* DataFrame method:

In [36]:
df1.merge(df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

## Appending DataFrames
<br><img align="left" src="http://drive.google.com/uc?export=view&id=1lSpzDfbRlY_mTlJH0t1xZADJUvbHyPMw" width=800 height=600>

In [37]:
df5 = DataFrame({'key': ['a', 'b', 'd'], 'data1': range(3)})
print('df1:\n', df1)
print('df5:\n',df5)

df1:
   key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6
df5:
   key  data1
0   a      0
1   b      1
2   d      2

In [38]:
pd.concat([df1, df5])

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6
0   a      0
1   b      1
2   d      2

In [39]:
pd.concat([df1, df5], axis=1)

  key  data1  key  data1
0   b      0    a    0.0
1   b      1    b    1.0
2   a      2    d    2.0
3   c      3  NaN    NaN
4   a      4  NaN    NaN
5   a      5  NaN    NaN
6   b      6  NaN    NaN

<font color = "blue"><p>
## Exercises

In [40]:
cs = pd.read_csv('Demo.csv', encoding='cp949', engine='python')
tr = pd.read_csv('구매내역정보.csv', encoding='cp949', engine='python')

In [41]:
cs

             ID  성별  연령     거주지역
0     478207946   1  84   서울 성동구
1     479806984   1  84   서울 서초구
2      94790213   1  84   부산 사상구
3     656026338   1  84  서울 영등포구
4     433076833   1  83   경기 고양시
...         ...  ..  ..      ...
3537  154314532   1  66   부산 사하구
3538  416998709   1  59   경기 수원시
3539  168692065   2  63   경기 안양시
3540  955481370   2  58   경기 의왕시
3541  821581510   2  64   경기 안양시

[3542 rows x 4 columns]

In [42]:
tr

,ID,상품대분류명,상품중분류명,구매지역,구매일자,구매시간,구매수량,구매금액,취소여부
0,410362886,의류잡화,여성용의류-정장류,서울 송파구,20140510,1,1,198000,0
1,643279402,식품,농산물,경기 성남시,20140612,1,1,2000,0
2,643279402,식품,농산물,경기 성남시,20140612,1,1,4000,0
3,643279402,식품,농산물,경기 성남시,20140612,1,1,5000,0
4,643279402,식품,농산물,경기 성남시,20140612,1,1,9000,0
...,...,...,...,...,...,...,...,...,...
101687,797822538,가전제품,휴대폰/태블릿,서울 중구,20140528,22,1,0,0
101688,797822538,가전제품,휴대폰/태블릿,서울 중구,20140528,22,1,9000,0
101689,862978930,레포츠,스포츠용품/의류,서울 강서구,20140817,22,1,88000,0
101690,968743249,가전제품,TV/AV,경기 성남시,20141031,22,1,2569000,0
101691,980881628,의류잡화,남성용의류-캐주얼,서울 중구,20140815,22,1,50000,0

**[연습문제 34]** `60대 여성` 고객리스트를 출력하시오.

In [7]:
cs.query('성별 == 1 and 60 <= 연령 <= 69')

             ID  성별  연령     거주지역
224   868529581   1  69   서울 송파구
227   663826861   1  69  서울 서대문구
230   410362886   1  69   부산 영도구
231   904352987   1  69  서울 동대문구
240   696566991   1  69   서울 노원구
...         ...  ..  ..      ...
3522  657285731   1  61   경기 수원시
3523  257825183   1  61    부산 남구
3533  765568307   1  69   부산 수영구
3536  164097706   1  67   경기 안양시
3537  154314532   1  66   부산 사하구

[318 rows x 4 columns]

**[연습문제 35]** `남성고객`과 `여성고객`은 각각 몇명인가?

In [20]:
cs.query('성별 == 1').성별.count()
cs.query('성별 == 2').성별.count()

2683

**[연습문제 36]** `여성고객`의 `평균나이`는 얼마인가?

In [12]:
cs.query('성별 == 1').연령.mean()

62.442374854481955

**[연습문제 37]** `70대 여성 고객`들은 주로 어느 `지역`에 거주하고 있는가? 상위 5개 지역만 나열하시오.

In [19]:
# cs.query('성별 == 1 and 70 <=연령 <= 79 ').거주지역.tail(5)
cs.query('성별 == 1 and 70 <=연령 <= 79 ').거주지역.value_counts().index[:5].to_list

**[연습문제 38]** (상품중분류명 기준) `Best seller`는 무엇인가?

In [18]:
tr.상품중분류명.value_counts().index[:1]

Index(['가공식품'], dtype='object')

**[연습문제 39]** `축산물`은 하루 중 언제 가장 많이 팔리는가?

In [35]:
tr.query('상품중분류명 == "축산물"').구매시간.value_counts().index[0]

18

In [37]:
# [연습문제 39.1] 농축산물은 하루 중 언제 가장 많이 팔리는가?

tr.query('상품중분류명 in ["축산물", "농산물"]').구매시간.value_counts().index[0]

17

**[연습문제 40]** 전 지역에서 `판매건수가 가장 많은 상품`의 `총 매출액`은 얼마인가? Hint: 난이도 매우 높음.

In [43]:
p = tr.상품중분류명.value_counts().index[0]
tr.query('상품중분류명 == @p').구매금액.sum()

218379000

In [50]:
p = tr.groupby('상품중분류명')['구매수량'].count().sort_values(ascending = False).index[0]
tr.query('상품중분류명 == @p').구매금액.sum()

218379000

<font color = "#CC3D3D"><p>
# End